In [1]:
import pandas as pd
import numpy as np

In [2]:
dict ={
    "name": ['choman', 'krishna', 'crishna'],
    'marks': [52, 36, 99],
    'city': ['mysore', 'dwaraka', 'mandya']
}

In [7]:
df = pd.DataFrame(dict)

- DataFrame is the one that convert the Dict to something similar to Excel

In [8]:
df

      name  marks     city
0   choman     52   mysore
1  krishna     36  dwaraka
2  crishna     99   mandya

- To export as csv file

In [1]:
df.to_csv("panda1.csv")

NameError: name 'df' is not defined

- If index not needed

In [10]:
df.to_csv('Friends.csv', index = False)

- to get only the top and last entry

In [12]:
df.head(1)

     name  marks    city
0  choman     52  mysore

In [13]:
df.tail(1)

      name  marks    city
2  crishna     99  mandya

- To get The description if the data like ---> Mean, srd, min max etc

In [14]:
df.describe()

           marks
count   3.000000
mean   62.333333
std    32.746501
min    36.000000
25%    44.000000
50%    52.000000
75%    75.500000
max    99.000000

- Read csv File

In [15]:
play = pd.read_csv('play.csv')

In [16]:
play

     USN    Name Branch
0  db031  choman    cse
1  db032     ckk    cse
2  db034    king    ise

- Edit dataframe

play['Name'][0] = 'Choman krishna'

In [21]:
play

     USN            Name Branch
0  db031  Choman krishna    cse
1  db032             ckk    cse
2  db034            king    ise

- Change the index

In [23]:
play.index = ['Onddu', 'Erradu', 'Murru']

In [24]:
play

          USN            Name Branch
Onddu   db031  Choman krishna    cse
Erradu  db032             ckk    cse
Murru   db034            king    ise